In [3]:
import pandas as pd


df = pd.DataFrame(["STD,City\tState",
"33,Kolkata\tWest Bengal",
"44,Chennai\tTamil Nadu",
"40,Hyderabad\tTelengana",
"80,Bangalore\tKarnataka"], columns=['row'])

In [4]:
df[['STD','City']]=df.row.str.split(',', expand=True)

In [5]:
df

                       row  STD                  City
0          STD,City\tState  STD           City\tState
1  33,Kolkata\tWest Bengal   33  Kolkata\tWest Bengal
2   44,Chennai\tTamil Nadu   44   Chennai\tTamil Nadu
3  40,Hyderabad\tTelengana   40  Hyderabad\tTelengana
4  80,Bangalore\tKarnataka   80  Bangalore\tKarnataka

In [6]:
df[['City','State']]=df.City.str.split('\t', expand=True)

In [7]:
df

                       row  STD       City        State
0          STD,City\tState  STD       City        State
1  33,Kolkata\tWest Bengal   33    Kolkata  West Bengal
2   44,Chennai\tTamil Nadu   44    Chennai   Tamil Nadu
3  40,Hyderabad\tTelengana   40  Hyderabad    Telengana
4  80,Bangalore\tKarnataka   80  Bangalore    Karnataka

In [8]:
del df['row']

In [9]:
df

   STD       City        State
0  STD       City        State
1   33    Kolkata  West Bengal
2   44    Chennai   Tamil Nadu
3   40  Hyderabad    Telengana
4   80  Bangalore    Karnataka